src/Catalogs/СД_Сервисы/СД_Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="11512439-e3e0-41fb-a7df-8073bc1d3471">
  <name>СД_Сервисы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="5df694b9-89da-449d-b687-945e2eec8ead">
    <name>ВидЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="db82eec1-4afb-4aa9-8038-d1a079a57a8f">
    <name>МоментФормированияТикета</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8436a1b3-9957-4754-994a-002e77a447bf">
    <name>ДиспетчерЗаявок</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="eb0accec-9749-4546-83b6-058789ca898b">
    <name>ОсновнойИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="17ba8715-ad5f-4a85-9409-a9d3882e8b52">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7f0f6add-58de-4b35-8e8e-fdda35397622">
    <name>БизнесПроцессСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="32432836-61b8-4c22-a403-50e76c4ae594">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="cedc0547-1602-4da5-a633-fda144e4b269">
    <name>ШаблонУспешнаяРегистрацияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="ffb0f0ca-9a7b-4c11-8659-50c4b4d5384b">
    <name>ШаблонПодготовленОтветРешение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15913f0b-e233-4883-804b-aa3a6cbf64b5">
    <name>ШаблонПодготовленОтветПояснение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="54adb12f-66ce-4997-8f70-33a6b15f17e4">
    <name>ШаблонОтказПревышениеЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="28ac2de2-3add-4a02-91bb-a22440fe1033">
    <name>Ч_ПользовательПочты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="2dbc8983-7fa2-4ff7-8b8f-024362a6a9a6">
    <name>Ч_СУО</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3e8a211e-1abd-4df0-855e-8ba3ecae9f64">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.Ч_ТипыЗаявокСД</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="1d54f30b-d019-4c8d-9f6f-ea619d65d4b0">
      <name>Приоритет</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СД_Приоритет</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="3e4f10d9-06e7-4c0f-a343-8310d677d55b">
      <name>Срок</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СД_Сервисы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЧСД_СверитьДанныеСУОПоТипу(ТипЗаявки, Приоритеты,СрокПоУмолчанию)
	
	СтруктураПоиска = Новый Структура("Тип,Приоритет", ТипЗаявки,);
	Пока Приоритеты.Следующий() Цикл
		СтруктураПоиска.Приоритет = Приоритеты.Наименование;
		Результат = Объект.Ч_СУО.НайтиСтроки(СтруктураПоиска);
		Если Результат.Количество() <= 0 Тогда
			Строка = Объект.Ч_СУО.Добавить();
			Строка.Тип = ТипЗаявки;
			Строка.Приоритет = Приоритеты.Ссылка;
			Строка.Срок =СрокПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЧСД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                       |    КОЛИЧЕСТВО(ССЫЛКА) КАК ВсегоЭлементов
                       |ИЗ
                       |    Справочник.СД_Приоритет КАК Спр";      
    Выборка = Запрос.Выполнить().Выгрузить();
	Если Объект.Ч_СУО.Количество() < Выборка[0].ВсегоЭлементов * 3 Тогда
		
		Приоритеты = Справочники.СД_Приоритет.Выбрать();
		ЧСД_СверитьДанныеСУОПоТипу(Перечисления.Ч_ТипыЗаявокСД.Обслуживание, Приоритеты, 8);
		ЧСД_СверитьДанныеСУОПоТипу(Перечисления.Ч_ТипыЗаявокСД.Инцидент, Приоритеты, 4);
		ЧСД_СверитьДанныеСУОПоТипу(Перечисления.Ч_ТипыЗаявокСД.Доработка, Приоритеты, 40);
		
	КонецЕсли;	
	
КонецПроцедуры
